Revit 2027 API
Field.SubEntityReadAccessGranted Method
 Checks whether there is read access to subentities storable in this field.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SubEntityReadAccessGranted()
Public Function SubEntityReadAccessGranted As Boolean
public:
bool SubEntityReadAccessGranted()
member SubEntityReadAccessGranted : unit -> bool
Return Value
Boolean
 True if subentities are readable.
See Also
Reference
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace